In [1]:
import pandas as pd

In [2]:
grades_df = pd.read_csv("Student_Grades copy.csv")
grades_df

    number_courses  time_study   grade
0                3       4.508  19.202
1                4       0.096   7.734
2                4       3.133  13.811
3                6       7.909  53.018
4                8       7.811  55.299
..             ...         ...     ...
95               6       3.561  19.128
96               3       0.301   5.609
97               4       7.163  41.444
98               7       0.309  12.027
99               3       6.335  32.357

[100 rows x 3 columns]

In [3]:
# 1.
std_dev = grades_df['grade'].std() # '.std()' returns the standard deviation of the 'grade' column
grades_df['rank'] = grades_df['grade'].rank() # '.rank()' returns the rank of each value in the 'grade' column in the grades dataframe
min_grade = grades_df['grade'].min() # '.min()' returns the minimum value from the 'grade' column
max_grade = grades_df['grade'].max() # '.max()' returns the maximum value from the 'grade' column
grade_range = max_grade - min_grade # calculates the range by subtracting the minimum grade from the maximum grade (stats concept)

std_dev

14.326198570757976

In [4]:
min_grade

5.609

In [5]:
max_grade

55.299

In [6]:
grade_range

49.69

In [7]:
grades_df # checking whether the rank column was added or not from ln[3] line 2 of code

    number_courses  time_study   grade   rank
0                3       4.508  19.202   46.0
1                4       0.096   7.734    9.0
2                4       3.133  13.811   30.0
3                6       7.909  53.018   96.0
4                8       7.811  55.299  100.0
..             ...         ...     ...    ...
95               6       3.561  19.128   45.0
96               3       0.301   5.609    1.0
97               4       7.163  41.444   85.0
98               7       0.309  12.027   22.0
99               3       6.335  32.357   73.0

[100 rows x 4 columns]

In [8]:
# climax of problem #1: applying the bell curve (normal) distribution to finally find the standard deviation of the bell curve(d) grades!
grades_df['bell_curve_grades'] = 100 * (grades_df['grade'] - min_grade)/grade_range
print("Standard Deviation:", round(std_dev, 2))

Standard Deviation: 14.33

In [9]:
# 2. Under the the bell-curve and equal to 70 and above grades parameters, using .shape() will return the number of students that passed under these conditions 
students_passed = grades_df[grades_df['bell_curve_grades'] >= 70].shape[0] # '.shape[0]' will return the number of rows a.k.a. the number of students (1st dimension of the two dimensions)
print(f"Number of students that passed under given parameters:", students_passed)

Number of students that passed under given parameters: 18